app/Controllers/Admin/Customer.php

    public function index()
    {
        $customerModel = new User();
        $rawCustomerData = $customerModel->findAll();
---
SELECT *
FROM `user`

    public function verifikasi()
    {
        try {
            $id_user = $this->request->getPost('id_user');
            $modelUser = new \App\Models\User();
            $modelPoint = new \App\Models\Fisher();

            $point = $modelPoint->where('id_user', $id_user)->first();

            if ($point) {
                $newData = [
                    'Esport'    => (int)$point['Esport'] + (int)$this->request->getPost('add_esport'),
                    'Badminton' => (int)$point['Badminton'] + (int)$this->request->getPost('add_badminton'),
                    'FootBall'  => (int)$point['FootBall'] + (int)$this->request->getPost('add_football'),
                    'Pimpong'   => (int)$point['Pimpong'] + (int)$this->request->getPost('add_pimpong'),
                    'Running'   => (int)$point['Running'] + (int)$this->request->getPost('add_running')
                ];

                $modelPoint->update($point['IDpoint'], $newData);
---
UPDATE `user` SET `setuju` = 'Sudah'
WHERE `user`.`id_user` IN ('1')
UPDATE `point` SET `Esport` = 352, `Badminton` = 323, `Running` = 3
WHERE `point`.`IDpoint` IN ('6')