app/Controllers/DetailEvent.php

    public function index($idevent)
    {
        $session = session();
        $userModel = new user();
        $MyEvent = new MyEventMod();
        $peserta = new Peserta();
        $jjura = new Juara();
        $fisherModel = new Fisher();
        $bracket = new bracket();
        $allUsers = $userModel->findAll();
        $namaPengguna = $session->get('id');
        $selectedevent = $MyEvent->where('id_event', $idevent)->findAll();
        $HH = $jjura->where('id_event', $idevent)->findAll();
---
SELECT *
FROM `user`
SELECT *
FROM `event`
WHERE `id_event` = '26'
SELECT *
FROM `juara`
WHERE `id_event` = '26'

    public function peserta($idevent)
    {
        $session = session();
        $userModel = new user();
        $MyEvent = new MyEventMod();
        $peserta = new Peserta();
        $jjura = new Juara();
        $bracket = new bracket();
        $allUsers = $userModel->findAll();
        $namaPengguna = $session->get('id');
        $Bracket = $bracket->where('id_event', $idevent)->first();
        $HH = $jjura->where('id_event', $idevent)->findAll();
---
SELECT *
FROM `user`
SELECT *
FROM `juara`
WHERE `id_event` = '47'

            // Set default values or handle the case when $HH is empty
            $semi1 = $semi2 = $semi3 = $semi4 = $semi5 = $semi6 = $semi7 = $semi8 = $semi9 = $semi10 = $semi11 = $semi12 = $semi13 = $semi14 = $semi15 = $semi16 = $Q1 = $Q2 = $Q3 = $Q4 = $Q5 = $Q6 = $Q7 = $Q8 = $P1 = $P2 = $P3 = $P4 = $final5 = $final6 = $j2 = $j1 = $j3 = null;
        }
        $selectedevent = $MyEvent->where('id_event', $idevent)->findAll();
---
SELECT *
FROM `event`
WHERE `id_event` = '47'

            // Ambil data dari tabel_lain berdasarkan primary key yang terkait dengan peserta1
            $tabelLainData = [];
            if (!empty($primaryKeys)) {
                $tabelLainData = $userModel->whereIn('id_user', $primaryKeys)->findAll();
---
SELECT *
FROM `user`
WHERE `id_user` IN ('33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33')

    public function acakPeserta($id_event)
    {
        $pesertaModel = new \App\Models\peserta();
        $eventModel = new \App\Models\Eventm();
        $bracketModel = new \App\Models\bracket();
        $model = new Fisher();
        $userModel = new user();

        // Ambil data event untuk ambil type_sport dan status_acak
        $selectedevent = $eventModel->where('id_event', $id_event)->findAll();
        if (!$selectedevent) {
            return redirect()->back()->with('error', 'Event tidak ditemukan.');
        }

        // ❗ Cek status acak
        if ($selectedevent[0]['Status_Acak'] === 'Sudah') {
            return redirect()->back()->with('error', 'Pengacakan sudah difinalisasi dan tidak dapat diubah lagi.');
        }

        $typeSport = $selectedevent[0]['type_sport'];
        if (!$typeSport) {
            return redirect()->back()->with('error', 'Jenis olahraga tidak ditemukan.');
        }

        // Ambil peserta untuk event ini
        $primaryKeys = $pesertaModel->where('id_event', $id_event)->findColumn('id_user');
        if (!$primaryKeys) {
            return redirect()->back()->with('error', 'Peserta tidak ditemukan.');
        }

        $tabelLainData = $userModel->whereIn('id_user', $primaryKeys)->findAll();
---
SELECT *
FROM `event`
WHERE `id_event` = '26'
 LIMIT 1
SELECT `id_user`
FROM `peserta`
WHERE `id_event` = '47'
SELECT *
FROM `user`
WHERE `id_user` IN ('33','64','31','28','13','44','26','23','60','52','27','57','2','24','63','29','3','1','25','32','19','16','18','42','22','15','43')

            $bracketData["peserta" . ($i + 1)] = $id_peserta;
        }

        $existing = $bracketModel->where('id_event', $id_event)->first();
        if ($existing) {
            $bracketModel->update($existing['id'], $bracketData);
---
SELECT *
FROM `bracket`
WHERE `id_event` = '47'
 LIMIT 1
UPDATE `bracket` SET `id_event` = '47', `peserta1` = '57', `peserta2` = '29', `peserta3` = '42', `peserta4` = '52', `peserta5` = '28', `peserta6` = '63', `peserta7` = '1', `peserta8` = '13', `peserta9` = '18', `peserta10` = '27', `peserta11` = '60', `peserta12` = '19', `peserta13` = '22', `peserta14` = '33', `peserta15` = '2', `peserta16` = '3', `peserta17` = '23', `peserta18` = '15', `peserta19` = '16', `peserta20` = '64', `peserta21` = '31', `peserta22` = '32', `peserta23` = '43', `peserta24` = '26', `peserta25` = '24', `peserta26` = '25', `peserta27` = '44'
WHERE `bracket`.`id` IN ('5')

    public function selesaiAcak($id_event)
    {
        $eventModel = new \App\Models\Eventm();

        $event = $eventModel->find($id_event);
        if (!$event) {
            return redirect()->back()->with('error', 'Event tidak ditemukan.');
        }

        if ($event['Status_Acak'] === 'Sudah') {
            return redirect()->back()->with('info', 'Pengacakan sudah dikunci sebelumnya.');
        }

        // Ubah status acak jadi "Sudah"
        $eventModel->update($id_event, ['Status_Acak' => 'Sudah']);
---
UPDATE `event` SET `Status_Acak` = 'Belum'
WHERE `event`.`id_event` IN ('26')