app/Controllers/DetailEvent.php

SELECT *
FROM `bracket`
WHERE `id_event` = '26'
 LIMIT 1
UPDATE `bracket` SET `id_event` = '26', `peserta1` = '63', `peserta2` = '57', `peserta3` = '60', `peserta4` = '20', `peserta5` = '16', `peserta6` = '26', `peserta7` = '19', `peserta8` = '33', `peserta9` = '52', `peserta10` = '22', `peserta11` = '43', `peserta12` = '23', `peserta13` = '21', `peserta14` = '3', `peserta15` = '31', `peserta16` = '30', `peserta17` = '13', `peserta18` = '29', `peserta19` = '2', `peserta20` = '25', `peserta21` = '44', `peserta22` = '15', `peserta23` = '18', `peserta24` = '64', `peserta25` = '14', `peserta26` = '32', `peserta27` = '24', `peserta28` = '17', `peserta29` = '42', `peserta30` = '27', `peserta31` = '28', `peserta32` = '1'
WHERE `bracket`.`id` IN ('1')
---
            $bracketData["peserta" . ($i + 1)] = $id_peserta;
        }

        $existing = $bracketModel->where('id_event', $id_event)->first();
        if ($existing) {
            $bracketModel->update($existing['id'], $bracketData);