app/Controllers/DetailEvent.php

SELECT *
FROM `user`
WHERE `id_user` IN ('2','50','67','54')
---
            // Ambil data dari tabel_lain berdasarkan primary key yang terkait dengan peserta1
            $tabelLainData = [];
            if (!empty($primaryKeys)) {
                $tabelLainData = $userModel->whereIn('id_user', $primaryKeys)->findAll();