app/Controllers/Home.php

    public function home()
    {
        $session = session();
        $userModel = new user();
        $MyEvent = new MyEventMod();
        $namaPengguna = $session->get('id');
        // Set your Merchant Server Key
        \Midtrans\Config::$serverKey = 'Mid-server-CSs0lXz4dk-c9gAqTGUBpRmu';
        // Set to Development/Sandbox Environment (default). Set to true for Production Environment (accept real transaction).
        \Midtrans\Config::$isProduction = true;
        // Set sanitization on (default)
        \Midtrans\Config::$isSanitized = true;
        // Set 3DS transaction for credit card to true
        \Midtrans\Config::$is3ds = true;

        if (!$session->has('id')) {
            $latestProducts = $MyEvent->where('Persetujuan', 'Sudah')->orderBy('id_event', 'DESC')->findAll(3);
            $data = [
                'compe' => $latestProducts,
                'title' => 'Home',

            ];
            echo view("home", $data);
        } else {
            $userModel = new user();
            $user = $userModel->getUserById($namaPengguna);
            $latestProducts = $MyEvent->where('Persetujuan', 'Sudah')->orderBy('id_event', 'DESC')->limit(3)->findAll(3);
---
SELECT *
FROM `event`
WHERE `Persetujuan` = 'Sudah'
ORDER BY `id_event` DESC
 LIMIT 3