app/Controllers/Join.php

SELECT *
FROM `event`
WHERE `id_event` = '26'
SELECT *
FROM `peserta`
WHERE `id_event` = '26'
AND `id_user` = '5'
---
    public function join()
    {
        $session = session();
        $namaPengguna = $session->get('id');
        $db = \Config\Database::connect();
        $MyEvent = new MyEventMod();

        $id_event = $this->request->getPost("idevent");
        $id_user = $this->request->getPost("iduser");

        $selectedevent = $MyEvent->where('id_event', $id_event)->findAll();

        // Ambil tambahan user (jika ada), default null
        $id_user1 = $this->request->getPost('id_user1') ?: '';
        $id_user2 = $this->request->getPost('id_user2') ?: '';
        $id_user3 = $this->request->getPost('id_user3') ?: '';
        $id_user4 = $this->request->getPost('id_user4') ?: '';


        // Cek apakah user utama sudah terdaftar
        $existingRecord = $db->table('peserta')
            ->where('id_event', $id_event)
            ->where('id_user', $id_user)
            ->get()
            ->getRow();

SELECT COUNT(*) AS `numrows`
FROM `peserta`
WHERE `id_event` = '26'
---
        }

        // Cek jumlah peserta event
        $participantCount = $db->table('peserta')
            ->where('id_event', $id_event)
            ->countAllResults();