app/Controllers/MyEvent.php

    public function index()
    {
        $session = session();
        $userModel = new user();
        $MyEvent = new MyEventMod();
        $namaPengguna = $session->get('id');
        $latestProducts = $MyEvent->where('id_user', $namaPengguna)->orderBy('id_event', 'DESC')->findAll();
---
SELECT *
FROM `event`
WHERE `id_user` = '3'
ORDER BY `id_event` DESC