app/Models/Eventm.php

INSERT INTO `event` (`id_user`, `title`, `date_column`, `time`, `organizer`, `type_sport`, `participant`, `location`, `upload`, `price`, `NOT`, `Status_Acak`, `Persetujuan`, `Tingkatan`) VALUES ('3', 'Test Bracket 32 ke 27', '2025-06-16', '09:11', 'Varis', 'Badminton', '32', 'Ubhinus', '1750039930_19067b27851b3a23d3f9.png', 'Rp 5.000.000', '1', 'Belum', 'Belum', 'Null')
---
    public function saveuser($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);

UPDATE `event` SET `title` = 'TOurna', `type_sport` = 'Running', `date_column` = '2023-09-29', `time` = '20:00', `participant` = '8', `location` = 'Online', `organizer` = 'Manusia'
WHERE `event`.`id_event` IN ('19')
---
    public function lol($id, $data)
    {
        return $this->update($id, $data); // otomatis pakai $primaryKey ('id_event')

UPDATE `event` SET `Status_Acak` = 'Belum'
WHERE `id_event` = '47'
AND `event`.`id_event` IN ('Status_Acak')
---
    public function StatusAcak($id, $data)
    {
        return $this->where('id_event', $id)
            ->update('Status_Acak', $data); // Misal 'Esport', 'Badminton', dll