app/Models/Peserta.php

INSERT INTO `peserta` (`id_event`, `id_user`, `id_user1`, `id_user2`, `id_user3`, `id_user4`) VALUES ('26', '5', '14', '20', '', '')
---
    public function saveuser($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);