app/Models/User.php

SELECT *
FROM `user`
WHERE `email` = '211111034@mhs.stiki.ac.id'
 LIMIT 1
---
    public function getUserByEmail($email)
    {
        return $this->where('email', $email)->first();

SELECT *
FROM `user`
WHERE `id_user` IS NULL
 LIMIT 1
---
    public function getUserById($id)
    {
        return $this->where('id_user', $id)->first();